docs/Primjeri_poruka_eIzvjestavanja/EvidentirajNaplatu_vise_racuna.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:eiz="http://www.porezna-uprava.gov.hr/fin/2024/types/eIzvjestavanje" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header/>
	<soapenv:Body>
		<eiz:EvidentirajNaplatuZahtjev eiz:id="12345">
			<eiz:Zaglavlje>
				<eiz:datumVrijemeSlanja>2024-02-27T15:28:00.0000</eiz:datumVrijemeSlanja>
			</eiz:Zaglavlje>
			<eiz:Naplata>
				<eiz:brojDokumenta>1234-2024-06</eiz:brojDokumenta>
				<eiz:datumIzdavanja>2024-02-27</eiz:datumIzdavanja>
				<eiz:oibPorezniBrojIzdavatelja>02994650199</eiz:oibPorezniBrojIzdavatelja>
				<eiz:oibPorezniBrojPrimatelja>00000000001</eiz:oibPorezniBrojPrimatelja>
				<eiz:datumNaplate>2024-06-17</eiz:datumNaplate>
				<eiz:naplaceniIznos>110.00</eiz:naplaceniIznos>
				<eiz:nacinPlacanja>T</eiz:nacinPlacanja>
			</eiz:Naplata>
			<eiz:Naplata>
				<eiz:brojDokumenta>1234/2024/06</eiz:brojDokumenta>
				<eiz:datumIzdavanja>2024-02-27</eiz:datumIzdavanja>
				<eiz:oibPorezniBrojIzdavatelja>02994650199</eiz:oibPorezniBrojIzdavatelja>
				<eiz:oibPorezniBrojPrimatelja>00000000001</eiz:oibPorezniBrojPrimatelja>
				<eiz:datumNaplate>2024-06-17</eiz:datumNaplate>
				<eiz:naplaceniIznos>100.00</eiz:naplaceniIznos>
				<eiz:nacinPlacanja>T</eiz:nacinPlacanja>
			</eiz:Naplata>
			<eiz:Naplata>
				<eiz:brojDokumenta>1234/2024/07</eiz:brojDokumenta>
				<eiz:datumIzdavanja>2024-02-27</eiz:datumIzdavanja>
				<eiz:oibPorezniBrojIzdavatelja>02994650199</eiz:oibPorezniBrojIzdavatelja>
				<eiz:oibPorezniBrojPrimatelja>00000000001</eiz:oibPorezniBrojPrimatelja>
				<eiz:datumNaplate>2024-06-17</eiz:datumNaplate>
				<eiz:naplaceniIznos>200.00</eiz:naplaceniIznos>
				<eiz:nacinPlacanja>O</eiz:nacinPlacanja>
			</eiz:Naplata>
			<eiz:Naplata>
				<eiz:brojDokumenta>1234/2024/08</eiz:brojDokumenta>
				<eiz:datumIzdavanja>2024-02-27</eiz:datumIzdavanja>
				<eiz:oibPorezniBrojIzdavatelja>02994650199</eiz:oibPorezniBrojIzdavatelja>
				<eiz:oibPorezniBrojPrimatelja>00000000001</eiz:oibPorezniBrojPrimatelja>
				<eiz:datumNaplate>2024-06-17</eiz:datumNaplate>
				<eiz:naplaceniIznos>5.00</eiz:naplaceniIznos>
				<eiz:nacinPlacanja>Z</eiz:nacinPlacanja>
			</eiz:Naplata>
			<eiz:Naplata>
				<eiz:brojDokumenta>1234/2024/09</eiz:brojDokumenta>
				<eiz:datumIzdavanja>2024-02-27</eiz:datumIzdavanja>
				<eiz:oibPorezniBrojIzdavatelja>02994650199</eiz:oibPorezniBrojIzdavatelja>
				<eiz:oibPorezniBrojPrimatelja>00000000001</eiz:oibPorezniBrojPrimatelja>
				<eiz:datumNaplate>2024-06-17</eiz:datumNaplate>
				<eiz:naplaceniIznos>3.50</eiz:naplaceniIznos>
				<eiz:nacinPlacanja>T</eiz:nacinPlacanja>
			</eiz:Naplata>
			<eiz:Naplata>
				<eiz:brojDokumenta>1234/2024/07</eiz:brojDokumenta>
				<eiz:datumIzdavanja>2024-02-27</eiz:datumIzdavanja>
				<eiz:oibPorezniBrojIzdavatelja>02994650199</eiz:oibPorezniBrojIzdavatelja>
				<eiz:oibPorezniBrojPrimatelja>00000000001</eiz:oibPorezniBrojPrimatelja>
				<eiz:datumNaplate>2024-06-17</eiz:datumNaplate>
				<eiz:naplaceniIznos>1.99</eiz:naplaceniIznos>
				<eiz:nacinPlacanja>O</eiz:nacinPlacanja>
			</eiz:Naplata>
			<eiz:Naplata>
				<eiz:brojDokumenta>1234/2024/10</eiz:brojDokumenta>
				<eiz:datumIzdavanja>2024-02-27</eiz:datumIzdavanja>
				<eiz:oibPorezniBrojIzdavatelja>02994650199</eiz:oibPorezniBrojIzdavatelja>
				<eiz:oibPorezniBrojPrimatelja>00000000001</eiz:oibPorezniBrojPrimatelja>
				<eiz:datumNaplate>2024-06-17</eiz:datumNaplate>
				<eiz:naplaceniIznos>2.99</eiz:naplaceniIznos>
				<eiz:nacinPlacanja>Z</eiz:nacinPlacanja>
			</eiz:Naplata>
			<eiz:Naplata>
				<eiz:brojDokumenta>1234/2024/11</eiz:brojDokumenta>
				<eiz:datumIzdavanja>2024-02-27</eiz:datumIzdavanja>
				<eiz:oibPorezniBrojIzdavatelja>02994650199</eiz:oibPorezniBrojIzdavatelja>
				<eiz:oibPorezniBrojPrimatelja>00000000001</eiz:oibPorezniBrojPrimatelja>
				<eiz:datumNaplate>2024-06-17</eiz:datumNaplate>
				<eiz:naplaceniIznos>1.85</eiz:naplaceniIznos>
				<eiz:nacinPlacanja>Z</eiz:nacinPlacanja>
			</eiz:Naplata>
			<eiz:Naplata>
				<eiz:brojDokumenta>1234/2024/12</eiz:brojDokumenta>
				<eiz:datumIzdavanja>2024-02-27</eiz:datumIzdavanja>
				<eiz:oibPorezniBrojIzdavatelja>02994650199</eiz:oibPorezniBrojIzdavatelja>
				<eiz:oibPorezniBrojPrimatelja>00000000001</eiz:oibPorezniBrojPrimatelja>
				<eiz:datumNaplate>2024-06-17</eiz:datumNaplate>
				<eiz:naplaceniIznos>3.33</eiz:naplaceniIznos>
				<eiz:nacinPlacanja>T</eiz:nacinPlacanja>
			</eiz:Naplata>
			<eiz:Naplata>
				<eiz:brojDokumenta>1234/2024/13</eiz:brojDokumenta>
				<eiz:datumIzdavanja>2024-02-27</eiz:datumIzdavanja>
				<eiz:oibPorezniBrojIzdavatelja>02994650199</eiz:oibPorezniBrojIzdavatelja>
				<eiz:oibPorezniBrojPrimatelja>00000000001</eiz:oibPorezniBrojPrimatelja>
				<eiz:datumNaplate>2024-06-17</eiz:datumNaplate>
				<eiz:naplaceniIznos>2.00</eiz:naplaceniIznos>
				<eiz:nacinPlacanja>T</eiz:nacinPlacanja>
			</eiz:Naplata>
			<ds:Signature Id="id">
				<ds:SignedInfo>
					<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
					<ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/>
					<ds:Reference Id="r-id-" URI="">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2002/06/xmldsig-filter2">
								<dsig-filter2:XPath xmlns:dsig-filter2="http://www.w3.org/2002/06/xmldsig-filter2" Filter="subtract">/descendant::ds:Signature</dsig-filter2:XPath>
							</ds:Transform>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/>
						<ds:DigestValue>Z5b...</ds:DigestValue>
					</ds:Reference>
					<ds:Reference Type="http://uri.etsi.org/01903#SignedProperties" URI="#xades-id-">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/>
						<ds:DigestValue>Ym2...</ds:DigestValue>
					</ds:Reference>
				</ds:SignedInfo>
				<ds:SignatureValue Id="value-id-">qf8..</ds:SignatureValue>
				<ds:KeyInfo>
					<ds:X509Data>
						<ds:X509Certificate>MII...</ds:X509Certificate>
					</ds:X509Data>
				</ds:KeyInfo>
			</ds:Signature>
		</eiz:EvidentirajNaplatuZahtjev>
	</soapenv:Body>
</soapenv:Envelope>